**English:** This cell defines the initial DataFrame, which is later replaced. 
**Hindi:** Yeh cell shuruaati DataFrame ko define karta hai, jise baad mein replace kar diya jaata hai.

In [1]:
import pandas as pd

data = {
    'Name': ['Amit', 'Neha', 'Ravi', 'Amit', 'Neha', None],
    'City': ['Pune', 'Mumbai', 'Pune', 'Delhi', None, 'Pune'],
    'Salary': [50000, 60000, 55000, 52000, 61000, None]
}

df = pd.DataFrame(data)

**English:** The following cells are commented out and contain scratch code. The main analysis begins further down where the DataFrame is redefined.
**Hindi:** Agle cells commented out hain aur unmein scratch code hai. Main analysis neeche shuru hota hai jahan DataFrame ko redefine kiya gaya hai.

In [2]:
# df

In [3]:
# df['Name'].fillna(df['Name'].mode()[0],inplace=True)

In [4]:
# df['Salary'].fillna(df['Salary'].mean().round(),inplace=True)

**English:** This cell redefines the DataFrame with a new, more detailed dataset that will be used for the rest of the analysis.
**Hindi:** Yeh cell DataFrame ko ek naye, zyada detailed dataset ke saath redefine karta hai jo baaki analysis ke liye istemal hoga.

In [5]:
import pandas as pd

data = {
    'Name': ['Amit', 'Neha', 'Ravi', 'Sita', 'Karan', 'Tina', 'Meena', 'Vijay', 'Rohit', 'Asha', None],
    'Department': ['HR', 'IT', 'IT', 'Sales', 'HR', 'Finance', 'Sales', 'IT', 'Finance', 'HR', 'IT'],
    'City': ['Pune', 'Mumbai', 'Pune', 'Delhi', 'Pune', None, 'Delhi', 'Pune', 'Mumbai', 'Delhi', 'Pune'],
    'Salary': [50000, 65000, 60000, 55000, None, 62000, 58000, 61000, 63000, 52000, None],
    'Experience': [2, 5, 3, 4, 1, 6, 2, 3, 5, 4, 2],
    'Email': ['amit@gmail.com', 'neha@yahoo.com', 'ravi@gmail.com', 'sita@outlook.com',
              'karan@gmail.com', 'tina@yahoo.com', 'meena@gmail.com', 'vijay@outlook.com',
              'rohit@gmail.com', 'asha@outlook.com', None]
}

df = pd.DataFrame(data)

**English:** Display the new DataFrame.
**Hindi:** Naya DataFrame display karein.

In [6]:
df

     Name Department    City   Salary  Experience              Email
0    Amit         HR    Pune  50000.0           2     amit@gmail.com
1    Neha         IT  Mumbai  65000.0           5     neha@yahoo.com
2    Ravi         IT    Pune  60000.0           3     ravi@gmail.com
3    Sita      Sales   Delhi  55000.0           4   sita@outlook.com
4   Karan         HR    Pune      NaN           1    karan@gmail.com
5    Tina    Finance    None  62000.0           6     tina@yahoo.com
6   Meena      Sales   Delhi  58000.0           2    meena@gmail.com
7   Vijay         IT    Pune  61000.0           3  vijay@outlook.com
8   Rohit    Finance  Mumbai  63000.0           5    rohit@gmail.com
9    Asha         HR   Delhi  52000.0           4   asha@outlook.com
10   None         IT    Pune      NaN           2               None

**English:** Fill missing values in 'Name' with 'unknown', in 'Salary' with the column's mean, and in 'Email' with 'No email'.
**Hindi:** 'Name' mein missing values ko 'unknown' se, 'Salary' ko column ke mean se, aur 'Email' ko 'No email' se bharein.

In [7]:
df['Name'].fillna('unkown', inplace = True)
df['Salary'].fillna(df['Salary'].mean().round(), inplace = True)
df['Email'].fillna('No email', inplace=True)

/tmp/ipykernel_2096/454266069.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna('unkown', inplace = True)
/tmp/ipykernel_2096/454266069.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean().round(), inplace = True)
/tmp/ipykernel_2096/454266069.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Email'].fillna('No email', inplace=True)

**English:** Display the DataFrame after handling the missing values.
**Hindi:** Missing values handle karne ke baad DataFrame display karein.

In [8]:
df

      Name Department    City   Salary  Experience              Email
0     Amit         HR    Pune  50000.0           2     amit@gmail.com
1     Neha         IT  Mumbai  65000.0           5     neha@yahoo.com
2     Ravi         IT    Pune  60000.0           3     ravi@gmail.com
3     Sita      Sales   Delhi  55000.0           4   sita@outlook.com
4    Karan         HR    Pune  58444.0           1    karan@gmail.com
5     Tina    Finance    None  62000.0           6     tina@yahoo.com
6    Meena      Sales   Delhi  58000.0           2    meena@gmail.com
7    Vijay         IT    Pune  61000.0           3  vijay@outlook.com
8    Rohit    Finance  Mumbai  63000.0           5    rohit@gmail.com
9     Asha         HR   Delhi  52000.0           4   asha@outlook.com
10  unkown         IT    Pune  58444.0           2           No email

**English:** Group the data by 'Department' and calculate the count and mean of 'Salary' for each department.
**Hindi:** Data ko 'Department' se group karein aur har department ke liye 'Salary' ka count aur mean calculate karein.

In [9]:
df.groupby('Department')['Salary'].agg(['count','mean'])

            count          mean
Department
Finance         2  62500.000000
HR              3  53481.333333
IT              4  61111.000000
Sales           2  56500.000000

**English:** Extract the email domain from the 'Email' column and create a new 'domain' column.
**Hindi:** 'Email' column se email domain nikalein aur ek naya 'domain' column banayein.

In [10]:
df['domain']=df['Email'].str.extract('@(.*)')

**English:** Count the number of employees for each email domain.
**Hindi:** Har email domain ke liye employees ki sankhya ginein.

In [11]:
df['domain'].value_counts().sort_values(ascending=False)

domain
gmail.com      5
outlook.com    3
yahoo.com      2
Name: count, dtype: int64

**English:** Create a pivot table to show the distribution of email domains across different cities.
**Hindi:** Alag-alag shehron mein email domains ka distribution dikhane ke liye ek pivot table banayein.

In [12]:
df.pivot_table(index='City', columns='domain', values='Department', aggfunc='size', fill_value=0)

domain  gmail.com  outlook.com  yahoo.com
City
Delhi           1            2          0
Mumbai          1            0          1
Pune            3            1          0

**English:** Filter the DataFrame to create a new one (`df1`) containing only employees with a salary greater than 60,000.
**Hindi:** Sirf 60,000 se zyada salary wale employees ke liye DataFrame ko filter karke ek naya DataFrame (`df1`) banayein.

In [13]:
df1 = df[df['Salary'] > 60000]

**English:** For the high-salary employees (`df1`), group by 'Department' and perform multiple aggregations for salary, experience, and employee count.
**Hindi:** High-salary wale employees (`df1`) ke liye, 'Department' se group karein aur salary, experience, aur employee count ke liye multiple aggregations perform karein.

In [14]:
df1.groupby('Department').agg(
    avg_salary=('Salary','mean'),
    max_salary=('Salary','max'),
    min_salary=('Salary','min'),
    avg_experience=('Experience','mean'),
    total_emp=('Name','count')
).sort_values(by='avg_salary', ascending=False)

            avg_salary  max_salary  min_salary  avg_experience  total_emp
Department
IT             63000.0     65000.0     61000.0             4.0          2
Finance        62500.0     63000.0     62000.0             5.5          2

**English:** Group by 'City', calculate the mean salary, then filter for cities where the mean salary is over 48,000.
**Hindi:** 'City' se group karein, mean salary calculate karein, fir un shehron ko filter karein jahan mean salary 48,000 se zyada hai.

In [15]:
df.groupby('City')['Salary'].mean().loc[lambda y : y > 48000].sort_values(ascending=True)

City
Delhi     55000.0
Pune      57577.6
Mumbai    64000.0
Name: Salary, dtype: float64

**English:** Group by 'Department' and perform aggregations, then filter the results to show departments with an average salary over 60,000.
**Hindi:** 'Department' se group karein aur aggregations perform karein, fir results ko filter karke un departments ko dikhayein jinka average salary 60,000 se zyada hai.

In [16]:
df.groupby('Department').agg(avg_salary =('Salary','mean'),
                            employee_count = ('Name','count')).loc[lambda y:y['avg_salary']>60000]

            avg_salary  employee_count
Department
Finance        62500.0               2
IT             61111.0               4

**English:** This is an advanced operation. First, a new summary DataFrame (`new_df`) is created. Then, a 'category' is created in `new_df`. Finally, this category is mapped back to the original DataFrame `df`.
**Hindi:** Yeh ek advanced operation hai. Pehle, ek naya summary DataFrame (`new_df`) banaya jaata hai. Fir, `new_df` mein ek 'category' banayi jaati hai. Aakhir mein, is category ko original DataFrame `df` par वापस map kiya jaata hai.

In [17]:
new_df = df.groupby('Department').agg(avg_salary=('Salary','mean'),
em_co = ('Name','count'))

In [ ]:
new_df['category'] = np.select([new_df['avg_salary']> 60000,
                                (new_df['avg_salary']> 40000)& (new_df['avg_salary']<=60000),
                                new_df['avg_salary']< 40000],
                                ['Hght_paying','medium_paying','low_paying'],
                                default = 'unknown')

NameError: name 'np' is not defined

Bad pipe message: %s [b' 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Sa']
Bad pipe message: %s [b'ri/537.36\r\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/', b'ng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7\r\nAccept-Encoding: gzip, deflate, br, zstd\r\nA']
Bad pipe message: %s [b'ept-Language: en-US,en;q=0.9,hi;q=0.8,mr;q=0.7\r\nPriority: u=0, i\r\nReferer: https://studio.firebase', b'oogle.com/\r\nSec-Ch-Ua: "Chromium";v="142", "G', b'gle Chrome";v="142", "Not_A Brand";v="99"\r\nSec-Ch-Ua-Arch: "x86"\r\nSec-Ch-Ua-Bitness: "64"\r\nSec-Ch-Ua-Form-Fact', b's: "Desktop"\r\nSec-Ch-Ua-Full-Version: "142.0.7444.60"\r\nSec-Ch-Ua-Full-Version-List: "Chromium";v="142.0.7444.6']
Bad pipe message: %s [b', "Google Chrome";v="142.0.7444.60", "Not_A Bra']
Bad pipe message: %s [b'";v="99.0.0.0"\r\nSec-Ch-Ua-Mobile: ?0\r\nSec-Ch-Ua-Model: ""\r\nSec-Ch-Ua-Platform: "Windows"\r\nSec-Ch-Ua-Platform-']
Bad pipe message: %s [b'rsion: "19.0.0"\r\nSec-Ch-Ua-Wow64: ?0\r\nSec-Fetch-Dest: iframe\r\nSec-Fetch-Mode: navigat', b'\nSec-Fetch-Site: cross-site\r\nSec-Fetch-Storage-Access: active\r\nSec-Fetch-User: ?1\r\nSec-User-Ip: 10.2', b'20.210\r\nUpgrade-Insecure-Requests: 1\r\nX-Forward']
Bad pipe message: %s [b'-Host: 37383-firebase-dsml-ghost-1758779015506.cluster-ancjwrkgr5dvux4qug5rbzyc2y.cloudworkstations.']

**English:** Map the new category from `new_df` to the original `df` based on the 'Department'.
**Hindi:** `new_df` se nayi category ko 'Department' ke aadhar par original `df` par map karein.

In [ ]:
df['salary_category'] = df['Department'].map(new_df['category'])

**English:** Display the final DataFrame with the new 'salary_category' column.
**Hindi:** Naye 'salary_category' column ke saath final DataFrame display karein.

In [ ]:
df